TienditaLibrosCAV2/test/NoExisteLibro/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tien="http://j2ee.netbeans.org/wsdl/TienditaLibrosOnline/DescriptorBPEL/TienditaWSDL">
  <soapenv:Body>
    <tien:TienditaWSDLOperation>
      <ISBN>85078645129112</ISBN>
      <unidades>3</unidades>
      <idCliente>1</idCliente>
    </tien:TienditaWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>